//
// Created by 李高峰 on 2020/4/11.
//
#include "obj.cpp"

int main() {
    obj a = obj(1, 0, -1);

    // (0, 0) 为圆心，2 为半径
    a.setCircle(0, 0, 2);

    // x = 1 和圆的交点
    a.line2circle();    // 交点：(1, 1.73205) (1, -1.73205)

    // y = 1 和圆的交点
    a.setLine(0, 1, -1);
    a.line2circle();    // 交点：(-1.73205, 1) (1.73205, 1)

    a.setLine(1, -1, 2 * 1.414);
    a.line2circle();    // 交点：(-1.43858, 1.38942) (-1.38942, 1.43858)

    // y = x + 2 * 1.415 和圆的交点 理论上 2 * √2 有一个交点，但无法精确表示
    // 带根号的数本来就不精确，再加上一顿算，所以倾斜的直线在这里基本不存在一个交点的情况，算不出来
    a.setLine(1, -1, 2 * 1.415);
    a.line2circle();    // 无交点

    // y = x 和圆的交点
    a.setLine(1, -1, 0);
    a.line2circle();    // 交点：(-1.41421, -1.41421) (1.41421, 1.41421)


    // y = x 和 y = -x 的交点
    a.line2line(1, 1, 0);    // 交点： (-0, 0)
    // y = x 和 y = x + 5 的交点
    a.line2line(1, -1, 5);  // 平行
    // y = x 和 y = x 的交点
    a.line2line(1, -1, 0);  // 重合
    // y = x 和 y = -x + 1000 的交点
    a.line2line(-1, -1, 1000);  // 交点： (500, 500)


    // y = x 和 (0, 0) (0, -2) (1, -2) (1, 0) 顺序打乱
    a.setRectangle(0, 0, 0, -2, 1, 0, 1, -2);
    a.line2rectangle(); // 与矩形交点：(0, 0)

    // y = x 和 (-2, 0) (-2, -2) (2, -2) (2, 0) 顺序打乱
    a.setRectangle(-2, -2, 2, 0, -2, 0, 2, -2);
    a.line2rectangle(); // 与矩形交点：(-2, -2)    与矩形交点：(0, 0)

    a.setLine(1, -0.5, 5);
    // y = 2x + 10 和 (0, 0) (10, 0) (10, 50) (0, 50) 顺序打乱
    a.setRectangle(0, 50, 10, 0, 0, 0, 10, 50);
    a.line2rectangle(); // 与矩形交点：(0, 10)    与矩形交点：(10, 30)

    a.setLine(2, -1, -5);
    // y = 2x - 5 和 (0, 0) (10, -1) (10, 100) (20, 99)
    a.setRectangle(0, 0, 10, -1, 10, 100, 20, 99);
    a.line2rectangle(); // 与矩形交点：(2.38095, -0.238095)   与矩形交点：(12, 19)
    return 0;
}